<template>
	<div>
		<el-dialog class="user_agreement" title="用户协议" v-model="check" size="tiny">
			<h4>一、关于</h4>
                本服务条款是您与杭州紫钺科技有限公司（下称紫钺）之间的协议。陶朱系统（下称本服务是由紫钺提供的互联网软件服务。在本服务创建账户并使用之前，您必须首先同意此条款。
        此条款在必要时将进行修订，且毋须另行通知。修订后的条款一旦在网页上公布即有效代替原来的服务条款。
        </P>
        <p>
        <h4>二、账户</h4>
        您同意并理解您有责任将您与用于获得服务的任何帐户相关的密码保密。您负责对您账户下发生的所有的行为和内容负责。
        </p>
        <P>
        <h4>三、内容和版权</h4>
        紫钺对您在本服务提交的内容没有所有权，这些内容的所有权仍然归您所有。但是，如果您将页面设置为公开，就意味着您允许其他人查看和共享您的内容。<br />
您明白紫钺对他人提供的任何内容不在任何方面负责或负有责任，紫钺没有义务预先审查此类内容。但是，紫钺有权随时决定内容是否合适和与本条款相符；如果发现此类内容违反本条款或在其他方面令人反感，紫钺可随时并有绝对酌情权预先审查、转移、拒绝、修改和/或删除内容，而不需事先通知。 本服务的外观设计与专利归紫钺所有。未经紫钺书面许可，您不能复制、拷贝，或者重用任何部分代码和外观设计。
        </P>
        <P>
        <h4>四、隐私政策</h4>
<p>使用本服务，即表示您同意紫钺合法收集和使用有关您及您所使用本服务的技术性或诊断性信息。收集到的些信息将用于改进网页的内容，提升我们的服务品质。 紫钺不会将您的信息和内容分享或出售给其他的团队。但以下情况除外：
o 您同意让第三方共享资料；
o 紫钺需要听从法庭传票、法律命令或遵循法律程序；
o 您违反了本条款。</p>
        <h4>五、终止</h4>
       <P>您可随时终止您的帐户和/或停用本服务。
紫钺可随时在某些情况下，不需事先通知，立即终止或暂停您所有或部分帐户和/或本服务之进入。此类服务终止的原因包括但不限于：
o 违反本服务条款；<br />
o 您要求取消或终止您的帐户；<br />
o 需要听从法庭传票、法律命令或遵循法律程序；<br />
o 突发的自然灾害导致的问题；<br />
o 战争、军事行动、暴动或武装叛乱；<br />
o 您没有支付与本服务相关的费用；<br />
一旦您的帐户被终止，阁下将无法正常使用本服务。此外，您可以选择删除您账户下的所有信息和内容。<br />
最近修订 2017年3月6日。<br />
©杭州紫钺科技有限公司 保留一切权利。<br />
        </p></P>

		</el-dialog>
	</div>
</template>

<script>
	export default {
		name: 'userAgreement',
		data: function(){
			return {
				check: false
			}
		}
	};
</script>

<style lang="scss">
	.user_agreement .el-dialog{
		width: 700px;
		.el-dialog__header{
			height: 40px;
			line-height: 40px;
			padding: 0px !important;
			text-align: center;
			background: #d8d8d8;
			box-shadow: 0 3px 3px grey;
		}
		.el-dialog__body{
			height: 540px;
			overflow: auto;
		}
		.el-dialog__headerbtn{
			width: 40px;
			.el-icon{
				color: #666;
			}
		}
	}
</style>
